In [6]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv("/home/atlantic/dev/censo_1872/planilhas/censo_1872_ce-002_p1.csv")

In [8]:
df.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28
0,NaN,NaN,NaN,Raças,NaN,NaN,NaN,Estados civis,NaN,NaN,...,Defeitos físicos,NaN,NaN,NaN,NaN,NaN,NaN,Casas,NaN,NaN
1,Condições,Sexos,Almas,Brancos,Pardos,Pretos,Caboclos,Solteiros,Casados,Viúvos,...,Cegos,Surdo-mudos,Aleijados,Dementes,Alienados,Ausentes,Transeuntes,Habitadas,Desabitadas,Fogos
2,Livres,Homens,10322,4940,4332,436,614,7154,2775,393,...,48,6,158,16,11,41,301,NaN,NaN,NaN
3,NaN,Mulheres,9867,4364,4601,470,432,6979,2097,791,...,41,9,32,21,9,76,247,NaN,NaN,NaN
4,NaN,Soma,20189,9304,8933,906,1046,14133,4872,1184,...,89,15,190,37,20,117,548,3359,1025,3403
5,Escravos,Homens,522,0,326,196,0,502,14,6,...,0,0,2,0,0,0,0,NaN,NaN,NaN
6,NaN,Mulheres,661,0,365,296,0,638,19,4,...,0,0,2,2,2,0,0,NaN,NaN,NaN
7,NaN,Soma,1183,0,691,492,0,1140,33,10,...,0,0,4,2,2,0,0,NaN,NaN,NaN
8,NaN,Soma geral,21372,9304,9624,1398,1046,15273,4905,1194,...,89,15,194,39,22,117,548,3359,1025,3403

In [9]:
print(df.columns)

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Instrução',
       'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22',
       'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25', 'Unnamed: 26',
       'Unnamed: 27', 'Unnamed: 28'],
      dtype='object')

# almas

In [10]:
almas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 2']]
almas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 2
0        NaN        NaN        NaN
1  Condições      Sexos      Almas
2     Livres     Homens      10322
3        NaN   Mulheres       9867
4        NaN       Soma      20189

In [11]:
new_header = almas.iloc[1]
almas.columns = new_header
almas = almas[2:]
almas.head()

1 Condições     Sexos  Almas
2    Livres    Homens  10322
3       NaN  Mulheres   9867
4       NaN      Soma  20189
5  Escravos    Homens    522
6       NaN  Mulheres    661

# raças

In [12]:
racas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6']]
racas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 3 Unnamed: 4 Unnamed: 5 Unnamed: 6
0        NaN        NaN      Raças        NaN        NaN        NaN
1  Condições      Sexos    Brancos     Pardos     Pretos   Caboclos
2     Livres     Homens       4940       4332        436        614
3        NaN   Mulheres       4364       4601        470        432
4        NaN       Soma       9304       8933        906       1046

In [13]:
new_header = racas.iloc[1]
racas.columns = new_header
racas = racas[2:]
racas.head(10)

1 Condições       Sexos Brancos Pardos Pretos Caboclos
2    Livres      Homens    4940   4332    436      614
3       NaN    Mulheres    4364   4601    470      432
4       NaN        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6       NaN    Mulheres       0    365    296        0
7       NaN        Soma       0    691    492        0
8       NaN  Soma geral    9304   9624   1398     1046

In [109]:
linha_h_livre = racas.loc[(racas["Condições"] == "Livres") & (racas["Sexos"] == "Homens")]
linha_h_livre["apply"] = linha_h_livre.apply(lambda x: x["Brancos"].values[0] + x["Pardos"].values[0] + x["Pretos"].values[0] + x["Caboclos"].values[0])
linha_h_livre

KeyError: 'Brancos'

In [98]:
group_names = ["Condições", "Sexos"]

group_cond = racas.groupby("Condições", as_index=False)
print(group_cond.ngroups)
group_sex = racas.groupby("Sexos", as_index=False)
print(group_sex)

2
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fe9a35c0640>

In [101]:
g1 = group_cond.get_group("Livres")
g1

1 Condições   Sexos Brancos Pardos Pretos Caboclos      soma_total
2    Livres  Homens    4940   4332    436      614  49404332436614

In [102]:
g2 = group_cond.get_group("Escravos")
g2

1 Condições   Sexos Brancos Pardos Pretos Caboclos soma_total
5  Escravos  Homens       0    326    196        0   03261960

In [107]:
g_homens = g1.groupby(["Sexos"], as_index=0)
g_homens

/tmp/ipykernel_9681/2020267595.py:2: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  g_homens.get_group("Homens")

1 Condições   Sexos Brancos Pardos Pretos Caboclos      soma_total
2    Livres  Homens    4940   4332    436      614  49404332436614

In [75]:
# linha_h_livre.Brancos + linha_h_livre.Pardos + linha_h_livre.Pretos + linha_h_livre.Caboclos
# linha_h_livre["Brancos"] + linha_h_livre["Pardos"] + linha_h_livre["Pretos"] + linha_h_livre["Caboclos"]
# linha_h_livre[["Brancos", "Pardos", "Pretos", "Caboclos"]].sum(axis=1)
linha_h_livre["soma_total"] = linha_h_livre["Brancos"].astype(int) + linha_h_livre["Pardos"].astype(int) + linha_h_livre["Pretos"].astype(int) + linha_h_livre["Caboclos"].astype(int)

/tmp/ipykernel_9681/936534941.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  linha_h_livre["soma_total"] = linha_h_livre["Brancos"].astype(int) + linha_h_livre["Pardos"].astype(int) + linha_h_livre["Pretos"].astype(int) + linha_h_livre["Caboclos"].astype(int)

In [79]:
linha_h_livre["Brancos"].values[0]

np.int64(4940)

In [77]:
(linha_h_livre["Brancos"].astype(int) / linha_h_livre["soma_total"].astype(int))*100

2    47.858942
dtype: float64

# estados civis

In [15]:
estados_civis = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9']]
estados_civis.head()

  Unnamed: 0 Unnamed: 1     Unnamed: 7 Unnamed: 8 Unnamed: 9
0        NaN        NaN  Estados civis        NaN        NaN
1  Condições      Sexos      Solteiros    Casados     Viúvos
2     Livres     Homens           7154       2775        393
3        NaN   Mulheres           6979       2097        791
4        NaN       Soma          14133       4872       1184

In [16]:
new_header = estados_civis.iloc[1]
estados_civis.columns = new_header
estados_civis = racas[2:]
estados_civis.head()

1 Condições       Sexos Brancos Pardos Pretos Caboclos
4       NaN        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6       NaN    Mulheres       0    365    296        0
7       NaN        Soma       0    691    492        0
8       NaN  Soma geral    9304   9624   1398     1046

# religião

In [17]:
religiao = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 10', 'Unnamed: 11']]
religiao.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 10 Unnamed: 11
0        NaN        NaN    Religião         NaN
1  Condições      Sexos   Católicos  Acatólicos
2     Livres     Homens       10288          34
3        NaN   Mulheres        9859           8
4        NaN       Soma       20147          42

In [18]:
religiao_header = religiao.iloc[1]
religiao.columns = religiao_header
religiao = religiao[2:]
religiao.head()

1 Condições     Sexos Católicos Acatólicos
2    Livres    Homens     10288         34
3       NaN  Mulheres      9859          8
4       NaN      Soma     20147         42
5  Escravos    Homens       522          0
6       NaN  Mulheres       661          0

# nacionalidaes

In [19]:
nacionalidades = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 12', 'Unnamed: 13']]
nacionalidades.head()

  Unnamed: 0 Unnamed: 1     Unnamed: 12   Unnamed: 13
0        NaN        NaN  Nacionalidades           NaN
1  Condições      Sexos     Brasileiros  Estrangeiros
2     Livres     Homens            9779           543
3        NaN   Mulheres            9661           206
4        NaN       Soma           19440           749

In [20]:
nacionalidades_header = nacionalidades.iloc[1]
nacionalidades.columns = nacionalidades_header
nacionalidades = nacionalidades[2:]
nacionalidades.head()

1 Condições     Sexos Brasileiros Estrangeiros
2    Livres    Homens        9779          543
3       NaN  Mulheres        9661          206
4       NaN      Soma       19440          749
5  Escravos    Homens         522            0
6       NaN  Mulheres         661            0

# Instrução

In [21]:
instrucao = df[['Unnamed: 0', 'Unnamed: 1', 'Instrução', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18']]
instrucao.head()

,Unnamed: 0,Unnamed: 1,Instrução,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN
1,Condições,Sexos,Sabem ler e escrever,Analfabetos,Frequentam escolas,Não frequentam escolas,Total
2,Livres,Homens,3266,7056,799,1711,2510
3,NaN,Mulheres,1170,8697,559,1896,2455
4,NaN,Soma,4436,15753,1358,3607,4965

In [22]:
instrucao_header = instrucao.iloc[0]
instrucao.columns = instrucao_header
instrucao = instrucao[1:]
instrucao.head()

,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN
1,Condições,Sexos,Sabem ler e escrever,Analfabetos,Frequentam escolas,Não frequentam escolas,Total
2,Livres,Homens,3266,7056,799,1711,2510
3,NaN,Mulheres,1170,8697,559,1896,2455
4,NaN,Soma,4436,15753,1358,3607,4965
5,Escravos,Homens,5,517,0,0,0

# Deficientes

In [23]:
deficientes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23']]
deficientes.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23
0,NaN,NaN,Defeitos físicos,NaN,NaN,NaN,NaN
1,Condições,Sexos,Cegos,Surdo-mudos,Aleijados,Dementes,Alienados
2,Livres,Homens,48,6,158,16,11
3,NaN,Mulheres,41,9,32,21,9
4,NaN,Soma,89,15,190,37,20

In [24]:
new_header = deficientes.iloc[1]
deficientes.columns = new_header
deficientes = deficientes[2:]
deficientes.head()

1 Condições     Sexos Cegos Surdo-mudos Aleijados Dementes Alienados
2    Livres    Homens    48           6       158       16        11
3       NaN  Mulheres    41           9        32       21         9
4       NaN      Soma    89          15       190       37        20
5  Escravos    Homens     0           0         2        0         0
6       NaN  Mulheres     0           0         2        2         2

# Ausentes

In [25]:
ausentes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 24']]
ausentes.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 24
0        NaN        NaN         NaN
1  Condições      Sexos    Ausentes
2     Livres     Homens          41
3        NaN   Mulheres          76
4        NaN       Soma         117

In [26]:
new_header = ausentes.iloc[1]
ausentes.columns = new_header
ausentes = ausentes[2:]
ausentes.head()

1 Condições     Sexos Ausentes
2    Livres    Homens       41
3       NaN  Mulheres       76
4       NaN      Soma      117
5  Escravos    Homens        0
6       NaN  Mulheres        0

In [27]:
transeuntes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 25']]
transeuntes.head()

  Unnamed: 0 Unnamed: 1  Unnamed: 25
0        NaN        NaN          NaN
1  Condições      Sexos  Transeuntes
2     Livres     Homens          301
3        NaN   Mulheres          247
4        NaN       Soma          548

In [28]:
new_header = transeuntes.iloc[1]
transeuntes.columns = new_header
transeuntes = transeuntes[2:]
transeuntes.head()

1 Condições     Sexos Transeuntes
2    Livres    Homens         301
3       NaN  Mulheres         247
4       NaN      Soma         548
5  Escravos    Homens           0
6       NaN  Mulheres           0

In [29]:
casas = df[['Unnamed: 1', 'Unnamed: 26', 'Unnamed: 27']]
casas.head()

  Unnamed: 1 Unnamed: 26  Unnamed: 27
0        NaN       Casas          NaN
1      Sexos   Habitadas  Desabitadas
2     Homens         NaN          NaN
3   Mulheres         NaN          NaN
4       Soma        3359         1025

In [30]:
new_header = casas.iloc[1]
casas.columns = new_header
casas = casas[2:]
casas.head()

1     Sexos Habitadas Desabitadas
2    Homens       NaN         NaN
3  Mulheres       NaN         NaN
4      Soma      3359        1025
5    Homens       NaN         NaN
6  Mulheres       NaN         NaN

In [31]:
fogos = df[['Unnamed: 1', 'Unnamed: 28']]
fogos.head()

  Unnamed: 1 Unnamed: 28
0        NaN         NaN
1      Sexos       Fogos
2     Homens         NaN
3   Mulheres         NaN
4       Soma        3403

In [32]:
new_header = fogos.iloc[1]
fogos.columns = new_header
fogos = fogos[2:]
fogos.head()

1     Sexos Fogos
2    Homens   NaN
3  Mulheres   NaN
4      Soma  3403
5    Homens   NaN
6  Mulheres   NaN